tutorials/microTGA/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

probeLocations
(
    ( 0.0 0.0 1e-6 )
    ( 0.0 0.00625 1e-6 )
    ( 0.0 0.0122 1e-6)
);

fields
(
    p
    Ts
    T
    N2
    targas
    gas
    Ywood
    Ychar
    Ychar1
    porosityF
    rhos 
    Msolidtotal
    Ytarsolid
    Srho
);

// ************************************************************************* //
